In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

# 5.1 pandas 数据结构介绍

## 5.1.1 Series

In [66]:
obj = pd.Series([4,7,-5,3])

In [67]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [68]:
obj2 = pd.Series([4,7,-5,3], index=['d','b','a','c'])

In [69]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [70]:
obj2['c']

3

In [71]:
obj2[['c','b','a']]

c    3
b    7
a   -5
dtype: int64

In [72]:
obj[obj>2]

0    4
1    7
3    3
dtype: int64

In [73]:
obj*2

0     8
1    14
2   -10
3     6
dtype: int64

In [74]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [75]:
'b' in obj2

True

In [76]:
'e' in obj2

False

In [77]:
sdata = {'ohio':35000, 'texas':71000, 'oregon':16000}

In [78]:
pd.Series(sdata)

ohio      35000
texas     71000
oregon    16000
dtype: int64

In [79]:
states = ['california', 'ohio', 'oregon', 'texas']
object2 = pd.Series(sdata, index=states)
object2

california        NaN
ohio          35000.0
oregon        16000.0
texas         71000.0
dtype: float64

In [80]:
pd.isnull(object2)

california     True
ohio          False
oregon        False
texas         False
dtype: bool

In [81]:
object2.isnull()

california     True
ohio          False
oregon        False
texas         False
dtype: bool

In [82]:
obj3 = pd.Series([35000,16000,71000,5000], index=['ohio','orengon','texas','utah'])

In [83]:
obj3

ohio       35000
orengon    16000
texas      71000
utah        5000
dtype: int64

In [84]:
obj3 + object2

california         NaN
ohio           70000.0
oregon             NaN
orengon            NaN
texas         142000.0
utah               NaN
dtype: float64

In [85]:
obj3

ohio       35000
orengon    16000
texas      71000
utah        5000
dtype: int64

In [86]:
obj3.name = 'population'

In [87]:
obj3

ohio       35000
orengon    16000
texas      71000
utah        5000
Name: population, dtype: int64

In [88]:
obj3.index = ['a','b','c','d']

In [89]:
obj3

a    35000
b    16000
c    71000
d     5000
Name: population, dtype: int64

## 5.1.2 DateFrame

In [2]:
data = {
    'state': ['ohio','ohio','ohio','necada','nevada','nevada'],
    'year': [2000,2001,2002,2001,2002,2003],
    'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
}

In [91]:
data

{'state': ['ohio', 'ohio', 'ohio', 'necada', 'nevada', 'nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [6]:
frame.index.name = 'aaa'

In [3]:
frame = pd.DataFrame(data)

In [7]:
frame

      state  year  pop
aaa
0      ohio  2000  1.5
1      ohio  2001  1.7
2      ohio  2002  3.6
3    necada  2001  2.4
4    nevada  2002  2.9
5    nevada  2003  3.2

In [94]:
frame.head()

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  necada  2001  2.4
4  nevada  2002  2.9

In [95]:
pd.DataFrame(data, columns = ['year', 'state', 'pop'])

   year   state  pop
0  2000    ohio  1.5
1  2001    ohio  1.7
2  2002    ohio  3.6
3  2001  necada  2.4
4  2002  nevada  2.9
5  2003  nevada  3.2

In [96]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], index=['one','two','three','four','five','six'])

In [97]:
frame2

       year   state  pop debt
one    2000    ohio  1.5  NaN
two    2001    ohio  1.7  NaN
three  2002    ohio  3.6  NaN
four   2001  necada  2.4  NaN
five   2002  nevada  2.9  NaN
six    2003  nevada  3.2  NaN

In [98]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [99]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [100]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [101]:
frame2

       year   state  pop debt
one    2000    ohio  1.5  NaN
two    2001    ohio  1.7  NaN
three  2002    ohio  3.6  NaN
four   2001  necada  2.4  NaN
five   2002  nevada  2.9  NaN
six    2003  nevada  3.2  NaN

In [102]:
frame2.loc['one']

year     2000
state    ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [103]:
frame2['debt'] = 333

In [104]:
frame2

       year   state  pop  debt
one    2000    ohio  1.5   333
two    2001    ohio  1.7   333
three  2002    ohio  3.6   333
four   2001  necada  2.4   333
five   2002  nevada  2.9   333
six    2003  nevada  3.2   333

In [105]:
frame2['debt'] = np.arange(6.)

In [106]:
frame2

       year   state  pop  debt
one    2000    ohio  1.5   0.0
two    2001    ohio  1.7   1.0
three  2002    ohio  3.6   2.0
four   2001  necada  2.4   3.0
five   2002  nevada  2.9   4.0
six    2003  nevada  3.2   5.0

In [107]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [108]:
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [109]:
frame2['debt'] = val

In [110]:
frame2

       year   state  pop  debt
one    2000    ohio  1.5   NaN
two    2001    ohio  1.7  -1.2
three  2002    ohio  3.6   NaN
four   2001  necada  2.4  -1.5
five   2002  nevada  2.9  -1.7
six    2003  nevada  3.2   NaN

In [114]:
frame2['eastern'] = frame2.year == 2000

In [115]:
frame2

       year   state  pop  debt  eastern
one    2000    ohio  1.5   NaN     True
two    2001    ohio  1.7  -1.2    False
three  2002    ohio  3.6   NaN    False
four   2001  necada  2.4  -1.5    False
five   2002  nevada  2.9  -1.7    False
six    2003  nevada  3.2   NaN    False

In [113]:
frame['year'] == 2000

0     True
1    False
2    False
3    False
4    False
5    False
Name: year, dtype: bool

In [116]:
frame2

       year   state  pop  debt  eastern
one    2000    ohio  1.5   NaN     True
two    2001    ohio  1.7  -1.2    False
three  2002    ohio  3.6   NaN    False
four   2001  necada  2.4  -1.5    False
five   2002  nevada  2.9  -1.7    False
six    2003  nevada  3.2   NaN    False

In [117]:
del frame2['eastern']

In [119]:
frame2

       year   state  pop  debt
one    2000    ohio  1.5   NaN
two    2001    ohio  1.7  -1.2
three  2002    ohio  3.6   NaN
four   2001  necada  2.4  -1.5
five   2002  nevada  2.9  -1.7
six    2003  nevada  3.2   NaN

In [120]:
pop = {
    'nevada': {2001:2.4, 2002:2.9},
    'ohio': {2000:1.5, 2001:1.7, 2002:3.6}
}

In [121]:
pop

{'nevada': {2001: 2.4, 2002: 2.9}, 'ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [122]:
frame3 = pd.DataFrame(pop)

In [123]:
frame3

      nevada  ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [124]:
frame3.T

        2001  2002  2000
nevada   2.4   2.9   NaN
ohio     1.7   3.6   1.5

In [126]:
frame3

      nevada  ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [127]:
pd.DataFrame(pop, index=[2001,2002,2003])

      nevada  ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [131]:
pdate = {
    'ohio': frame3['ohio'][:-1],
    'nevada': frame3['nevada'][:2]
}

In [132]:
frame3

      nevada  ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [133]:
pdate

{'ohio': 2001    1.7
 2002    3.6
 Name: ohio, dtype: float64,
 'nevada': 2001    2.4
 2002    2.9
 Name: nevada, dtype: float64}

In [135]:
pd.DataFrame(pdate)

      ohio  nevada
2001   1.7     2.4
2002   3.6     2.9

In [136]:
frame3

      nevada  ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [139]:
frame3.index.name = 'year'

In [140]:
frame3

      nevada  ohio
year
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [142]:
frame3.columns.name = 'state'

In [143]:
frame3

state  nevada  ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [144]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [145]:
frame2.values

array([[2000, 'ohio', 1.5, nan],
       [2001, 'ohio', 1.7, -1.2],
       [2002, 'ohio', 3.6, nan],
       [2001, 'necada', 2.4, -1.5],
       [2002, 'nevada', 2.9, -1.7],
       [2003, 'nevada', 3.2, nan]], dtype=object)

## 5.1.3 索引对象

In [2]:
obj = pd.Series(range(3), index = ['a','b','c'])

In [3]:
obj

a    0
b    1
c    2
dtype: int64

In [4]:
indexs = obj.index

In [5]:
indexs

Index(['a', 'b', 'c'], dtype='object')

In [6]:
indexs[1]

'b'

In [7]:
indexs[1] = 3

TypeError: Index does not support mutable operations

In [8]:
labels = pd.Index(np.arange(3))

In [9]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [10]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [11]:
obj2.index

Int64Index([0, 1, 2], dtype='int64')

In [12]:
obj2.index is labels

True

# 5.2 基本功能

## 5.2.1 重建索引

In [14]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index = ['d','b','a','c'])

In [15]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [17]:
obj.reindex(['a','b','c','d','e'])

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [18]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index = [0,2,4])

In [19]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [20]:
obj3[2]

'purple'

In [25]:
obj3.reindex(range(6), method='nearest')

0      blue
1    purple
2    purple
3    yellow
4    yellow
5    yellow
dtype: object

In [26]:
obj3.reindex?

In [27]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
                    index = ['a','c','d'],
                     columns = ['ohio', 'texas', 'california']
                    )

In [28]:
frame

   ohio  texas  california
a     0      1           2
c     3      4           5
d     6      7           8

In [29]:
frame.reindex(['a','b','c','d'])

   ohio  texas  california
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [33]:
frame.reindex(index= ['a','b','c','d'], 
              columns=['california', 'texas', 'ohio'])

   california  texas  ohio
a         2.0    1.0   0.0
b         NaN    NaN   NaN
c         5.0    4.0   3.0
d         8.0    7.0   6.0

In [34]:
frame

   ohio  texas  california
a     0      1           2
c     3      4           5
d     6      7           8

In [38]:
frame.loc[['a','d'], ['california', 'texas']]

   california  texas
a           2      1
d           8      7

## 5.2.2 轴向上删除条目

In [57]:
frame.drop?

In [42]:
obj = pd.Series(np.arange(5.), index = 'a b c d e'.split())

In [43]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [45]:
new_obj = obj.drop('c')

In [46]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [47]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [49]:
obj.drop(['a','d','e'])

b    1.0
c    2.0
dtype: float64

In [8]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index='ohio colorado utah new_york'.split(),
                    columns = 'one two three four'.split()
                   )

In [9]:
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
new_york   12   13     14    15

In [52]:
data.drop(['colorado', 'utah'])

          one  two  three  four
ohio        0    1      2     3
new_york   12   13     14    15

In [53]:
data.drop('two', axis=1)

          one  three  four
ohio        0      2     3
colorado    4      6     7
utah        8     10    11
new_york   12     14    15

In [54]:
data.drop(columns= 'one')

          two  three  four
ohio        1      2     3
colorado    5      6     7
utah        9     10    11
new_york   13     14    15

In [55]:
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
new_york   12   13     14    15

In [10]:
data.drop(index=['utah', 'ohio'],
         columns=['one','four'],
         )

          two  three
colorado    5      6
new_york   13     14

In [58]:
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
new_york   12   13     14    15

In [59]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [60]:
obj.drop('c',inplace=True)

In [61]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

## 5.2.3 索引、选择与过滤

In [62]:
obj = pd.Series(np.arange(4.), index=['a','b','c','d'])

In [63]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [64]:
obj['b']

1.0

In [65]:
obj[1]

1.0

In [67]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [68]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [69]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [70]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [71]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [73]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [74]:
obj['a':'c'] = 5

In [75]:
obj

a    5.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [76]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index = 'ohio colorado utah new_york'.split(),
                    columns = 'one two three four'.split()
                   )

In [77]:
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
new_york   12   13     14    15

In [78]:
data['two']

ohio         1
colorado     5
utah         9
new_york    13
Name: two, dtype: int32

In [79]:
data[['one','two']]

          one  two
ohio        0    1
colorado    4    5
utah        8    9
new_york   12   13

In [81]:
data[:2]

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7

In [82]:
data['ohio':'utah']

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11

In [83]:
data[data['three']>5]

          one  two  three  four
colorado    4    5      6     7
utah        8    9     10    11
new_york   12   13     14    15

In [84]:
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
new_york   12   13     14    15

In [85]:
data <5

            one    two  three   four
ohio       True   True   True   True
colorado   True  False  False  False
utah      False  False  False  False
new_york  False  False  False  False

In [87]:
data[data<5]

          one  two  three  four
ohio      0.0  1.0    2.0   3.0
colorado  4.0  NaN    NaN   NaN
utah      NaN  NaN    NaN   NaN
new_york  NaN  NaN    NaN   NaN

In [88]:
data[data<5] = 0

In [89]:
data

          one  two  three  four
ohio        0    0      0     0
colorado    0    5      6     7
utah        8    9     10    11
new_york   12   13     14    15

### 5.2.3.1 使用loc 和 iloc 选择数据

In [92]:
data.loc[['colorado'], ['two', 'three']]

          two  three
colorado    5      6

In [91]:
data

          one  two  three  four
ohio        0    0      0     0
colorado    0    5      6     7
utah        8    9     10    11
new_york   12   13     14    15

In [93]:
data.iloc[2, [3,0,1]]

four    11
one      8
two      9
Name: utah, dtype: int32

In [94]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: utah, dtype: int32

In [95]:
data.iloc[[1,2], [3,0,1]]

          four  one  two
colorado     7    0    5
utah        11    8    9

In [99]:
data.loc[:'utah', 'two':'two']

          two
ohio        0
colorado    5
utah        9

In [100]:
data.iloc[:, :3][data.three<5]

      one  two  three
ohio    0    0      0

## 5.2.4 整数索引

In [2]:
ser = pd.Series(np.arange(3.))

In [3]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [5]:
ser[0]

0.0

In [6]:
ser.loc[1]

1.0

In [7]:
ser.loc[:2]

0    0.0
1    1.0
2    2.0
dtype: float64

In [9]:
ser.iloc[:2]

0    0.0
1    1.0
dtype: float64

## 5.2.5 算数和数据对齐

In [11]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index = list('acde'))

In [12]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [13]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index = list('acefg'))

In [14]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [15]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [17]:
df1 = pd.DataFrame(np.arange(9.).reshape(3,3), 
                   columns = list('bcd'),
                   index = 'ohio texas colorado'.split()
                  )

In [18]:
df1

            b    c    d
ohio      0.0  1.0  2.0
texas     3.0  4.0  5.0
colorado  6.0  7.0  8.0

In [19]:
df2 = pd.DataFrame(np.arange(12.).reshape(4,3), 
                  columns = list('bde'),
                  index = 'utah ohio texas oregon'.split()
                  )

In [20]:
df2

          b     d     e
utah    0.0   1.0   2.0
ohio    3.0   4.0   5.0
texas   6.0   7.0   8.0
oregon  9.0  10.0  11.0

In [21]:
df1+df2

            b   c     d   e
colorado  NaN NaN   NaN NaN
ohio      3.0 NaN   6.0 NaN
oregon    NaN NaN   NaN NaN
texas     9.0 NaN  12.0 NaN
utah      NaN NaN   NaN NaN

### 5.2.5.1 使用填充值的算数方法

In [22]:
df1  = pd.DataFrame(np.arange(12.).reshape(3,4),
                    columns = list('abcd')
                   )

In [23]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [24]:
df2 = pd.DataFrame(np.arange(20.).reshape(4,5),
                  columns = list('abcde')
                  )

In [25]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [27]:
df1.loc[1, 'c'] = np.nan

In [28]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   NaN   7.0
2  8.0  9.0  10.0  11.0

In [29]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0   NaN  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [30]:
df1.add(df2, fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0   7.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [31]:
df2.loc[1, 'c'] = np.nan

In [32]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0   NaN  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [33]:
1/df1

       a         b    c         d
0    inf  1.000000  0.5  0.333333
1  0.250  0.200000  NaN  0.142857
2  0.125  0.111111  0.1  0.090909

In [37]:
df1.rdiv(1)

       a         b    c         d
0    inf  1.000000  0.5  0.333333
1  0.250  0.200000  NaN  0.142857
2  0.125  0.111111  0.1  0.090909

In [38]:
df1.div(1)

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   NaN   7.0
2  8.0  9.0  10.0  11.0

### 5.2.5.2 DataFrame 和 Series 间的操作

In [40]:
arr = np.arange(12.).reshape(3,4)

In [41]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [42]:
arr[0]

array([0., 1., 2., 3.])

In [43]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [46]:
frame = pd.DataFrame(np.arange(12.).reshape(4,3),
                    columns = list('bde'),
                    index = ['utah', 'ohio', 'texas', 'oregon']
                    )

In [47]:
frame

          b     d     e
utah    0.0   1.0   2.0
ohio    3.0   4.0   5.0
texas   6.0   7.0   8.0
oregon  9.0  10.0  11.0

In [48]:
frame['d']

utah       1.0
ohio       4.0
texas      7.0
oregon    10.0
Name: d, dtype: float64

In [49]:
series = frame.iloc[0]

In [50]:
series

b    0.0
d    1.0
e    2.0
Name: utah, dtype: float64

In [51]:
frame - series

          b    d    e
utah    0.0  0.0  0.0
ohio    3.0  3.0  3.0
texas   6.0  6.0  6.0
oregon  9.0  9.0  9.0

In [54]:
series2 = pd.Series(range(3), index = list('bef'))

In [55]:
series2

b    0
e    1
f    2
dtype: int64

In [56]:
frame + series2

          b   d     e   f
utah    0.0 NaN   3.0 NaN
ohio    3.0 NaN   6.0 NaN
texas   6.0 NaN   9.0 NaN
oregon  9.0 NaN  12.0 NaN

In [60]:
series3 = frame['d']
series3

utah       1.0
ohio       4.0
texas      7.0
oregon    10.0
Name: d, dtype: float64

In [57]:
frame

          b     d     e
utah    0.0   1.0   2.0
ohio    3.0   4.0   5.0
texas   6.0   7.0   8.0
oregon  9.0  10.0  11.0

In [63]:
frame.sub(series3, axis='index')

          b    d    e
utah   -1.0  0.0  1.0
ohio   -1.0  0.0  1.0
texas  -1.0  0.0  1.0
oregon -1.0  0.0  1.0

## 5.2.6 函数应用和映射

In [2]:
frame = pd.DataFrame(np.random.randn(4,3), columns = list('bde'),
                     index = 'utah ohio texas oregon'.split())

In [3]:
frame

               b         d         e
utah   -1.581684  1.935873 -1.622398
ohio   -0.192997 -0.147310 -0.437695
texas  -0.160561 -1.001600 -1.190014
oregon -0.219208  0.192225  0.950233

In [4]:
np.abs(frame)

               b         d         e
utah    1.581684  1.935873  1.622398
ohio    0.192997  0.147310  0.437695
texas   0.160561  1.001600  1.190014
oregon  0.219208  0.192225  0.950233

In [5]:
f = lambda x : x.max() - x.min()

In [6]:
frame.apply(f)

b    1.421123
d    2.937473
e    2.572631
dtype: float64

In [9]:
frame.apply(f, axis = 1)

utah      3.558271
ohio      0.290385
texas     1.029453
oregon    1.169440
dtype: float64

In [10]:
def f(x):
    return pd.Series([x.min(), x.max()], index = ['min', 'max'])

In [11]:
frame

               b         d         e
utah   -1.581684  1.935873 -1.622398
ohio   -0.192997 -0.147310 -0.437695
texas  -0.160561 -1.001600 -1.190014
oregon -0.219208  0.192225  0.950233

In [14]:
frame.apply(f)

          b         d         e
0 -1.581684 -1.001600 -1.622398
1 -0.160561  1.935873  0.950233

In [13]:
def f(x):
    return x.min(), x.max()

In [17]:
function = lambda x: '%.2f'% x

In [18]:
frame.applymap(function)

            b      d      e
utah    -1.58   1.94  -1.62
ohio    -0.19  -0.15  -0.44
texas   -0.16  -1.00  -1.19
oregon  -0.22   0.19   0.95

In [19]:
frame

               b         d         e
utah   -1.581684  1.935873 -1.622398
ohio   -0.192997 -0.147310 -0.437695
texas  -0.160561 -1.001600 -1.190014
oregon -0.219208  0.192225  0.950233

In [20]:
frame['e']

utah     -1.622398
ohio     -0.437695
texas    -1.190014
oregon    0.950233
Name: e, dtype: float64

In [22]:
frame['e'].map(function)

utah      -1.62
ohio      -0.44
texas     -1.19
oregon     0.95
Name: e, dtype: object

## 5.2.7 排序和排名

In [23]:
frame = pd.DataFrame(np.arange(8).reshape(2,4),
                    index = ['three', 'one'],
                    columns = list('dabc'))

In [24]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [25]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [27]:
frame.sort_index(axis=1).sort_index()

       a  b  c  d
one    5  6  7  4
three  1  2  3  0

In [28]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [30]:
frame.sort_values(by = 'd')

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [31]:
obj = pd.Series([4,7,-3,2])

In [32]:
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [33]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [34]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [35]:
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [36]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [38]:
frame = pd.DataFrame({
    'b':[4,7,-3,2],
    'a':[0,1,0,1]
})

In [40]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [41]:
frame.sort_values(by = 'b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [42]:
frame.sort_values(by = ['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [3]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [4]:
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [5]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [6]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [7]:
obj.rank(method = 'max')

0    7.0
1    1.0
2    7.0
3    5.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [8]:
frame  = pd.DataFrame({
    'b': [4.3, 7, -3, 2],
    'a': [0, 1, 0, 1],
    'c': [-2, 5, 8, -2.5]
})

In [10]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [11]:
frame.rank()

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

In [12]:
frame.rank(axis=1)

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [13]:
frame.rank?

## 5.2.8 含有重复标签的轴索引

In [15]:
obj = pd.Series(range(5), index = 'a a b b c'.split() )

In [16]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [17]:
obj['a']

a    0
a    1
dtype: int64

In [18]:
obj['c']

4

In [19]:
df = pd.DataFrame(np.random.randn(4,3), index = list('aabb'))

In [20]:
df

          0         1         2
a  0.199207  0.383888 -0.990226
a -0.904184  1.454037 -0.376414
b  2.763406 -0.883216 -0.307242
b -0.922953  1.244341  0.242170

In [21]:
df[1]

a    0.383888
a    1.454037
b   -0.883216
b    1.244341
Name: 1, dtype: float64

In [22]:
df.loc['a']

          0         1         2
a  0.199207  0.383888 -0.990226
a -0.904184  1.454037 -0.376414

In [23]:
df.loc['b']

          0         1         2
b  2.763406 -0.883216 -0.307242
b -0.922953  1.244341  0.242170

# 5.3 描述性统计的概述与计算

In [11]:
df = pd.DataFrame([
    [1.4, np.nan], [7.1, -4.5],
    [np.nan, np.nan], [0.75, -1.3]
], columns = 'one two'.split())

In [12]:
df

    one  two
0  1.40  NaN
1  7.10 -4.5
2   NaN  NaN
3  0.75 -1.3

In [14]:
df.quantile()

one    1.4
two   -2.9
Name: 0.5, dtype: float64

In [36]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [37]:
df.sum(axis=1)

0    1.40
1    2.60
2    0.00
3   -0.55
dtype: float64

In [38]:
df.mean()

one    3.083333
two   -2.900000
dtype: float64

In [39]:
df.mean(axis=1, skipna=False)

0      NaN
1    1.300
2      NaN
3   -0.275
dtype: float64

In [40]:
df.idxmax()

one    1
two    3
dtype: int64

In [41]:
df

    one  two
0  1.40  NaN
1  7.10 -4.5
2   NaN  NaN
3  0.75 -1.3

In [44]:
df.index.is_unique

True

In [45]:
df.cumsum()

    one  two
0  1.40  NaN
1  8.50 -4.5
2   NaN  NaN
3  9.25 -5.8

In [46]:
df.cummin()

    one  two
0  1.40  NaN
1  1.40 -4.5
2   NaN  NaN
3  0.75 -4.5

In [47]:
df

    one  two
0  1.40  NaN
1  7.10 -4.5
2   NaN  NaN
3  0.75 -1.3

In [49]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [52]:
obj = pd.Series(['a', 'a', 'b', 'c']*4)

In [53]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [54]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [56]:
df.cumprod()

     one   two
0  1.400   NaN
1  9.940 -4.50
2    NaN   NaN
3  7.455  5.85

In [58]:
df.pct_change()

        one       two
0       NaN       NaN
1  4.071429       NaN
2  0.000000  0.000000
3 -0.894366 -0.711111

In [59]:
df

    one  two
0  1.40  NaN
1  7.10 -4.5
2   NaN  NaN
3  0.75 -1.3

## 5.3.1 相关性和协方差

In [2]:
# 暂无

## 5.3.2 唯一值、计数和成员属性

In [3]:
obj = pd.Series(list('cadaabbcc'))

In [4]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [5]:
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [7]:
obj.unique().sort()

In [8]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [9]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [10]:
mask = obj.isin(['b', 'c'])

In [11]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object